app/controllers/admin_controller.rb

SELECT `menus`.* FROM `menus` WHERE (`menus`.menulist_id IN (1,2))
SELECT * FROM `menu_lists` ORDER BY position ASC
SELECT * FROM `menulists` ORDER BY position ASC
---
  def menu
    @menu = Menu.all
    @menulist = Menulist.all

SELECT * FROM "categories"
---
  def category
    @cat = Category.all