app/controllers/categories_controller.rb

SELECT * FROM `categories`
---
  def index
    @Cat = Category.find :all

SELECT * FROM `categories` WHERE (`categories`.`id` = 4)
SELECT * FROM `posts` WHERE (`posts`.`category_id` = 3)
---
  def show
    @Cat = Category.find(params[:id])
    @posts = Post.find_all_by_category_id(@Cat.id)

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def edit
    @Cat = Category.find(params[:id])

INSERT INTO "categories" ("name", "slug", "created_at", "updated_at", "parent_id", "description") VALUES('Test', 'test', '2010-07-20 23:01:39', '2010-07-20 23:01:39', NULL, 'asdfasdfsadf
---
  def create
    @Cat = Category.new(params[:category])
    if @Cat.save