app/controllers/comments_controller.rb

SELECT * FROM `comments` WHERE (`comments`.post_id = 1)
SELECT * FROM `posts` WHERE (`posts`.`id` = 1) LIMIT 1
INSERT INTO `comments` (`created_at`, `updated_at`, `post_id`, `user_id`, `parent_id`, `content`, `post_comment_id`) VALUES('2009-11-24 17:39:09', '2009-11-24 17:39:09', 1, NULL, NULL, 'test', 1)
UPDATE `posts` SET `updated_at` = '2009-11-24 17:39:09', `comment_total` = 1 WHERE `id` = 1
---
  def create
    @comment = Comment.new(params[:comment])
    @comment.user_id = session[:user]
    @comment.post_id = params[:id]
    @comment.parent_id = params[:parent_id]
    @post = Post.find_by_id(@comment.post_id)
    @post.comment_total = @post.comment_total + 1
    @comment.post_comment_id = @post.comment_total

    if @comment.save