app/controllers/menus_controller.rb

INSERT INTO "menus" ("name", "updated_at", "menulist_id", "path", "position", "created_at") VALUES('Home', '2010-07-21 02:06:48', 1, 'root_path', 1, '2010-07-21 02:06:48')
---
  def create
    @menu = Menu.new(params[:menus])
    @menu.save

SELECT * FROM `menus` WHERE (`menus`.`id` = 3)
SELECT * FROM "menulists"
---
  def edit
    @menu = Menu.find(params[:id])
    @menulist = Menulist.all

SELECT * FROM `menus` WHERE (`menus`.`id` = 3)
DELETE FROM `menus` WHERE `id` = 6
---
  def destroy
    @menu = Menu.find(params[:id])
    @menu.destroy