app/controllers/menulists_controller.rb

  def create
    @menulist = Menulist.new(params[:menulists])
    @menulist.save
---
INSERT INTO "menulists" ("name", "position", "created_at", "updated_at") VALUES('Navigation', NULL, '2010-07-20 22:53:07', '2010-07-20 22:53:07')
INSERT INTO `menu_lists` (`name`, `position`, `created_at`, `updated_at`) VALUES('test1', 0, '2009-12-03 01:03:04', '2009-12-03 01:03:04')

  def edit
    @menulist = Menulist.find(params[:id])
---
SELECT * FROM "menulists" WHERE ("menulists"."id" = 1)

  def destroy
    @menulist = Menulist.find(params[:id])
    @menus = Menu.find_by_menulist_id(@menulist.id)
    @menulist.destroy
---
SELECT * FROM `menulists` WHERE (`menulists`.`id` = 1)
SELECT * FROM `menus` WHERE (`menus`.`menulist_id` = 3) LIMIT 1
DELETE FROM `menulists` WHERE `id` = 1
DELETE FROM `menus` WHERE `id` = 7