app/controllers/posts_controller.rb

  def index
    @posts = Post.find :all
    @categories = Category.all
---
SELECT * FROM `posts`
SELECT * FROM `categories`

  def new
    @post = Post.new
    @categories = Category.all
    if(params[:id])
      @category = Category.find_by_id(params[:id])
---
SELECT * FROM `categories`
SELECT * FROM `categories` WHERE (`categories`.`id` = '1') LIMIT 1

  def create
    @post = Post.new(params[:post])

    if @post.save
---
INSERT INTO `posts` (`created_at`, `title`, `body`, `published`, `updated_at`, `page`, `category_id`, `user_id`, `comment_total`, `state`) VALUES('2009-11-24 17:39:06', 'test', '<p>testst</p>', NULL, '2009-11-24 17:39:06', 0, NULL, NULL, 0, 'draft')